const Discord = require('discord.js');
const client = new Discord.Client();
const 1 = new Discord.Client();
const 2 = new Discord.Client();

console.log("Welcome Savage.");
 
client.on('ready', async() => {
var server = "510406975654330368"; 
var channel = "510408873765634058";
    setInterval(()=>{
    client.guilds.get(server).channels.get(channel).send('**  سافج سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج سافج  سافج  سافج  سافج  سافج سافج سافج سافج سافج سافج سافج سافج  سافج  سافج  سافج سافج سافج سافج رسافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج  سافج  سافج سافج  سافج سافج  سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  **')
    },305);
})


1.on('ready', async() => {
var server = "510406975654330368"; 
var channel = "510408873765634058";
    setInterval(()=>{
    client.guilds.get(server).channels.get(channel).send('**  سافج سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج سافج  سافج  سافج  سافج  سافج سافج سافج سافج سافج سافج سافج سافج  سافج  سافج  سافج سافج سافج سافج رسافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج  سافج  سافج سافج  سافج سافج  سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  **')
    },305);
})

2.on('ready', async() => {
var server = "510406975654330368"; 
var channel = "510408873765634058";
    setInterval(()=>{
    client.guilds.get(server).channels.get(channel).send('**  سافج سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج سافج  سافج  سافج  سافج  سافج سافج سافج سافج سافج سافج سافج سافج  سافج  سافج  سافج سافج سافج سافج رسافج  سافج  سافج  سافج سافج  سافج  سافج  سافج سافج  سافج  سافج سافج  سافج سافج  سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج سافج  **')
    },305);
})


client.login(process.env.BOT_TOKEN);
1.login(process.env.BOT_TOKEN1);
2.login(process.env.BOT_TOKEN2);
